# Дана строка, состоящая из слов, разделенных пробелами. Напишите программу
# которая подсчитывает количество слов в строке

simple_input = "Timur forever young"
print(simple_input.count(' ') + 1)
print(len(simple_input.split()))