# Напишите программу, которая принимает на вход строку, и отслеживает, сколько раз каждый символ
# уже встречался. Количество повторов добавляется к символам с помощью постфикса формата _n
# input aaabcaadcdd
# Output aa_1a_2bca_3a_4dc_1d_1d_2
# Использовать ф-ию .split()

n = input('Введите строку: ')
print(n)